app/controllers/dashboard_controller.rb

  def index
    # TODO: Update timeline to include dynamic AJAX updates.
    # Timeline UI
    @timeline_width = Configuration.find_retry(:name => "ui.url_stats_timeline.width", :namespace => "UrlStatistic")
---
SELECT * FROM `urls` WHERE (`urls`.job_id = 1)

    @url_queue_update_frequency = Configuration.find_retry(:name => "ui.url_queue.update_frequency", :namespace => "UrlStatistic")

    # Running VMs Gauge
    @running_vms_count = Client.calculate_without_cache(:count, :id, :conditions => {:client_status_id => ClientStatus.find_by_status("running").id})
---
SELECT `client_statuses`.id FROM `client_statuses` WHERE (`client_statuses`.`status` = BINARY 'created' AND `client_statuses`.status = 'created' AND `client_statuses`.id <> 1) LIMIT 1